<a href="https://colab.research.google.com/github/hidenobi/PythonPTIT/blob/master/Document_Python_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Python

## Python Variables

Identifier Naming

Variables are the example of identifiers. An Identifier is used to identify the literals used in the program. The rules to name an identifier are given below.

- The first character of the variable must be an alphabet or underscore ( _ ).
- All the characters except the first character may be an alphabet of lower-case(a-z), upper-case (A-Z), underscore, or digit (0-9).
- Identifier name must not contain any white-space, or special character (!, @, #, %, ^, &, *).
Identifier name must not be similar to any keyword defined in the language.
- Identifier names are case sensitive; for example, my name, and MyName is not the same.
- Examples of valid identifiers: a123, _n, n_9, etc.
- Examples of invalid identifiers: 1a, n%4, n 9, etc.

### Object References

In [ ]:
a = 50

![a=50](https://static.javatpoint.com/python/images/python-variables.png)

In the above image, the variable a refers to an integer object.

Suppose we assign the integer value 50 to a new variable b.

In [ ]:
a = 50
b = a

![b=a=50](https://static.javatpoint.com/python/images/python-variables2.png)

The variable b refers to the same object that a points to because Python does not create another object.

Let's assign the new value to b. Now both variables will refer to the different objects.

In [ ]:
a =  50
b = 100

![a=50;b=100](https://static.javatpoint.com/python/images/python-variables3.png)

Python manages memory efficiently if we assign the same variable to two different values.

### Object Identity

In Python, every created object identifies uniquely in Python. Python provides the guaranteed that no two objects will have the same identifier. The built-in id() function, is used to identify the object identifier. Consider the following example.

In [ ]:
a = 50  
b = a  
print(id(a))  
print(id(b))  
# Reassigned variable a  
a = 500  
print(id(a))

#@markdown We assigned the b = a, a and b both point
#@markdown to the same object. When we checked by
#@markdown the id() function it returned the same
#@markdown number. We reassign a to 500; then it
#@markdown referred to the new object identifier.

10916064
10916064
140208136639888

## Variable Names

We have already discussed how to declare the valid variable. Variable names can be any length can have uppercase, lowercase (A to Z, a to z), the digit (0-9), and underscore character(_). Consider the following example of valid variables names.

In [ ]:
name = "Devansh"  
age = 20  
marks = 80.50  
  
print(name)  
print(age)  
print(marks)

Devansh
20
80.5

In [ ]:
name = "A"  
Name = "B"  
naMe = "C"  
NAME = "D"  
n_a_m_e = "E"  
_name = "F"  
name_ = "G"  
_name_ = "H"  
na56me = "I"  
  
print(name,Name,naMe,NAME,n_a_m_e, NAME, n_a_m_e, _name, name_,_name, na56me)

A B C D E D E F G F I

## Python Keywords

Python Keywords are special reserved words that convey a special meaning to the compiler/interpreter. Each keyword has a special meaning and a specific operation. These keywords can't be used as a variable. Following is the List of Python Keywords.

|          |        |       |         |      |
|----------|--------|-------|---------|------|
|True	   |False	|None	|and	  |as    |
|asset	   |def	    |class	|continue |break |
|else	   |finally	|elif	|del	  |except|
|global	   |for	    |if	    |from	  |import|
|raise	   |try	    |or	    |return	  |pass  |
|nonlocal  |in	    |not	|is	      |lambda|

## Python Comments

To apply the comment in the code we use the hash(#) at the beginning of the statement or code.

In [ ]:
# This is the comment statement

Multiline Python Comment

We must use the hash(#) at the beginning of every line of code to apply the multiline Python comment. Consider the following example.

In [ ]:
# First line of the comment   
# Second line of the comment  
# Third line of the comment

We can also use the triple quotes ('''''') for multiline comment. The triple quotes are also used to string formatting. Consider the following example.

Docstrings Python Comment

The docstring comment is mostly used in the module, function, class or method. It is a documentation Python string. We will explain the class/method in further tutorials.

**Example:**

In [ ]:
def intro():  
  """ 
  This function prints Hello CoderSchool 
  """  
  print("Hi CoderSchool")              
intro()

Hi CoderSchool

We can check a function's docstring by using the __doc__ attribute.

In [ ]:
print(intro.__doc__)

  This function prints Hello CoderSchool

## Integer and Float

### 1. Integer

In [ ]:
x = 4
type(x)

int

### 2. Float

In [ ]:
y = 4.5
type(y)

float

### 3. Arithmetic operators

In [ ]:
#@title + (Addition)

print(x + 2)
print(y + 2)

6
6.5

In [ ]:
#@title - (Subtraction)

print(x - 2)
print(y - 2)

2
2.5

In [ ]:
#@title / (divide)

print(x / 2)
print(y / 2)

2.0
2.25

In [ ]:
#@title * (Multiplication)

print(x * 2)
print(y * 2)

8
9.0

In [ ]:
#@title % (reminder)

print((x + 1) % 2)
print(y % 2)

1
0.5

In [ ]:
#@title // (Floor division)

print((x + 1) // 2)
print(y // 2)

2
2.0

In [ ]:
#@title ** (Exponent)

print(x ** 2)
print(y ** 2)

16
20.25

### 4. Assignment Operators

In [ ]:
a, b = 20, 10

In [ ]:
print("a:", a, "b:", b)
a += b
print("a += b => a =", a)

a: 20 b: 10
a += b => a = 30

In [ ]:
print("a:", a, "b:", b)
a -= b
print("a -= b => a =", a)

a: 30 b: 10
a -= b => a = 20

In [ ]:
print("a:", a, "b:", b)
a *= b
print("a *= b => a =", a)

a: 20 b: 10
a *= b => a = 200

In [ ]:
print("a:", a, "b:", b)
a %= b
print("a %= b => a =", a)

a: 200 b: 10
a %= b => a = 0

In [ ]:
print("a:", a, "b:", b)
a **=b
print("a **= b => a =", a)

a: 0 b: 10
a **= b => a = 0

In [ ]:
print("a:", a, "b:", b)
a //=b
print("a //= b => a =", a)

a: 0 b: 10
a //= b => a = 0

## Boolean

reference link: [Notes about booleans and logical operators](http://thomas-cokelaer.info/tutorials/python/boolean.html)

1.   **True** - It represents the Boolean true, if the given condition is true, then it returns "True". Non-zero values are treated as true.
2.   **False** - It represents the Boolean false; if the given condition is false, then it returns "False". Zero value is treated as false
3.   **None** - It denotes the null value or void. An empty list or Zero can't be treated as None.

### 4. Logical Operators

In [1]:
#@title **and** - It is a logical operator. It is used to check the multiple conditions. It returns true if both conditions are true. Consider the following truth table.

#@markdown  |A	    |B	   |A and B|
#@markdown  |-------|------|-------|
#@markdown  |True	|True  |True   |
#@markdown  |True	|False |False  |
#@markdown  |False	|True  |False  |
#@markdown  |False	|False |False  |

print(True and True)
print(True and False)
print(False and True)
print(False and False)

True
False
False
False

In [2]:
#@title **or** - It is a logical operator in Python. It returns true if one of the conditions is true. Consider the following truth table.

#@markdown  |A	    |B	   |A or B|
#@markdown  |-------|------|------|
#@markdown  |True	|True  |True  |
#@markdown  |True	|False |True  |
#@markdown  |False	|True  |True  |
#@markdown  |False	|False |False |

print(True  or True)
print(True  or False)
print(False or True)
print(False or False)

True
True
True
False

In [3]:
#@title **not** - It is a logical operator and inverts the truth value. Consider the following truth table.

#@markdown  |A	  |not A|
#@markdown  |-----|-----|
#@markdown  |True |False|
#@markdown  |False|True |

print(not True)
print(not False)

False
True

### 5. Comparison operator

In [4]:
a, b = 2019, 2020

print("a == b", a == b)
print("a != b", a != b)
print("a <= b", a <= b)
print("a >= b", a >= b)
print("a <  b", a <  b)
print("a >  b", a >  b)

a == b False
a != b True
a <= b True
a >= b False
a <  b True
a >  b False

### 6. Membership Operators

a. in

In [5]:
"Code" in "Code school"

True

In [6]:
'G' in 'GDG Hanoi'

True

b. not in

In [7]:
2 not in [6, 7, 8]

True

In [8]:
"D" not in "Vietnam"

True

### 7. Identity Operators

In [9]:
name = "GDG Hanoi"
local = name

In [10]:
local is name

True

In [11]:
local is not name

False

## String

Reference [Python Strings](https://developers.google.com/edu/python/strings)

### Creating String in Python

In [ ]:
#Using single quotes  
str1 = 'Hello "Dev" C'  
print(str1)  
#Using double quotes  
str2 = "Hello 'Dev' C"  
print(str2)  
  
#Using triple quotes  
str3 = '''''Triple quotes are generally used for  
    represent the multiline or 
    docstring'''   
print(str3)

Hello "Dev" C
Hello 'Dev' C
''Triple quotes are generally used for
    represent the multiline or
    docstring

[Note:] String in python is **immutable**

### Indexing

![](https://lh3.googleusercontent.com/-WNOOzlAbmB4fdFdactyzZ0rd4eiw3fbQHjopYenkSVW-Nqt3QvjYHIW2SI04yn9tkXclQ8iia_Loi6H7gyP7iIROHAlppc-QT_9XPyPzUVJgxH3RWvxgixZQsh_n6g7AF5JxxnXt3zn83M5YbwFGbPodlWuuaOI-A5NW8YHl4UGxb0MrbNC_E2t40bhEl80BlKWZmPcL-oFHimsHZl8TnPhAxdfYYu8gahhtEkZotJSdmQRTcqj0QMf5-SHzAwp7fGnhhKEEDD2SKxg4nFhtgNSV_rVdXo8rxb9vj2u5g6O3eZXxnGtDrY5wsBTJgpDwnzHY4KGwnkxTWBRoYKH9sLjnBQgfgULUu9LiJHr90tmS1Mw4z4m_KzvVCB70q3jDLNoE370NJghhbWXhDUM4Abcq2J-pYAQvbaOyyUZJS6PLOp-58mRl6GTFOjMx7so6SSr_xHqeJJYxfYqDfnZ_gUe_AuokO8C52MJ5hQkMDWDiZ_VUahww7pmocku4fW-Hs2U6BL5qNeynb4h2jg7WXRl7dIEfG0qCLVPzCJwQY_lYka9t8mzJ8oLaOg25tPKdn03QyZA5cFaHqfpjNpVvbmWt3Kl2k3Sgvtm5YrjVVVBcG82Hqk2zBZmeW5dJ25-uV-774Fs3Sr0kR7aPQESSDYPIct79SXRqg=w269-h150-no)

Like other languages, the indexing of the Python strings starts from 0.

In [ ]:
word = "hello"
print(word[0])
print(len(word))
print(word + " there")

h
5
hello there

Unlike Java, the '+' does not automatically convert numbers or other types to string form. The str() function converts values to a string form so they can be combined with other strings.

In [ ]:
  pi = 3.14
  ##text = 'The value of pi is ' + pi      ## NO, does not work
  text = 'The value of pi is '  + str(pi)  ## yes
  text

'The value of pi is 3.14'

### String Methods

Reference [python.org string methods](https://docs.python.org/3/library/stdtypes.html#string-methods)

In [ ]:
string = "  Hello Hanoi  "

In [ ]:
print(string.lower())
print(string.upper())

  hello hanoi
  HELLO HANOI

In [ ]:
print(string.rstrip())
print(string.lstrip())

#@markdown strip will returns a string with whitespace removed from the start and end
print(string.strip())

  Hello Hanoi
Hello Hanoi
Hello Hanoi

In [ ]:
print(string.startswith("  "))
print(string.endswith("hello"))

True
False

In [ ]:
print(string.find("Hanoi"))

8

In [ ]:
print(string.replace('Hanoi', 'Danang'))

  Hello Danang

In [ ]:
print(string.split())

['Hello', 'Hanoi']

In [ ]:
print(' '.join(string.split()))

Hello Hanoi

### Slices

In [ ]:
word = "hello"

In [ ]:
#@markdown - word[1:4] is 'ell' -- chars starting at index 1 and extending up to but not including index 4
print(word[1:4:2]) 
#@markdown - word[1:] is 'ello' -- omitting either index defaults to the start or end of the string
print(word[1:])
#@markdown - word[:] is 'Hello' -- omitting both always gives us a copy of the whole thing (this is the pythonic way to copy a sequence like a string or list)
print(word[:])
#@markdown - word[1:100] is 'ello' -- an index that is too big is truncated down to the string length
print(word[1:100])

el
ello
hello
ello

In [ ]:
print(word[-1])
#@markdown - word[-1] is 'o' -- last char (1st from the end)
print(word[-4])
#@markdown - word[-4] is 'e' -- 4th from the end
print(word[:-3])
#@markdown - word[:-3] is 'He' -- going up to but not including the last 3 chars.
print(word[-3:])
#@markdown - word[-3:] is 'llo' -- starting with the 3rd char from the end and extending to the end of the string.

o
e
he
llo

### String %

Python has a printf()-like facility to put together a string. The % operator takes a printf-type format string on the left (%d int, %s string, %f/%g floating point), and the matching values in a tuple on the right (a tuple is made of values separated by commas, typically grouped inside parentheses):

In [ ]:
# % operator
text = "%d little pigs come out, or I'll %s, and I'll %s, and I'll blow your %s down." % (3, 'huff', 'puff', 'house')
text

"3 little pigs come out, or I'll huff, and I'll puff, and I'll blow your house down."

In [ ]:
# Add parentheses to make the long line work:
text = (
    "%d little pigs come out, or I'll %s, and I'll %s, and I'll blow your %s down."
    % (3, 'huff', 'puff', 'house')
)

text

"3 little pigs come out, or I'll huff, and I'll puff, and I'll blow your house down."

In [ ]:
# Split the line into chunks, which are concatenated automatically by Python
text = (
    "%d little pigs come out, "
    "or I'll %s, and I'll %s, "
    "and I'll blow your %s down."
    % (3, 'huff', 'puff', 'house')
)
text

"3 little pigs come out, or I'll huff, and I'll puff, and I'll blow your house down."

String {}

In [ ]:
text = "{0} little pigs come out, or I'll {1}, and I'll {2}, and I'll blow your {3} down.".format(3, 'huff', 'puff', 'house')
text

"3 little pigs come out, or I'll huff, and I'll puff, and I'll blow your house down."

In [ ]:
num = 3
name1 = 'huff'
name2 = 'puff'
name3 = 'house'

text = f"{num} little pigs come out, or I'll {name1}, and I'll {name2}, and I'll blow your {name3} down."
text

"3 little pigs come out, or I'll huff, and I'll puff, and I'll blow your house down."

### Unicode

In [ ]:
u_string = 'Việt Nam đẹp lắm ta ơi.'
u_string

'Việt Nam đẹp lắm ta ơi.'

In [ ]:
# Convert string unicode to bytes utf-8
b = u_string.encode('utf-8')
b

b'Vi\xe1\xbb\x87t Nam \xc4\x91\xe1\xba\xb9p l\xe1\xba\xafm ta \xc6\xa1i.'

In [ ]:
# Convert ngược lại từ encoded bytes thành chuỗi unicode
u = b.decode('utf-8')
u

'Việt Nam đẹp lắm ta ơi.'

## Tuple

Python Tuple is used to store the sequence of immutable Python objects. The tuple is similar to lists since the value of the items stored in the list can be changed, whereas the tuple is immutable, and the value of the items stored in the tuple cannot be changed.

In [ ]:
T1 = (101, "Peter", 22)    
T2 = ("Apple", "Banana", "Orange")     
T3 = 10,20,30,40,50  
  
print(type(T1))  
print(type(T2))  
print(type(T3))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

## List

A list in Python is used to store the sequence of various types of data. Python lists are mutable type its mean we can modify its element after it created. However, Python consists of six data-types that are capable to store the sequences, but the most common and reliable type is the list.

A list can be defined as a collection of values or items of different types. The items in the list are separated with the comma (,) and enclosed with the square brackets [].

In [ ]:
L1 = ["John", 102, "USA"]    
L2 = [1, 2, 3, 4, 5, 6]

print(type(L1))

<class 'list'>

Updating List values

In [ ]:
print(L2)
L2[3] = 7
print(L2)

[1, 2, 3, 4, 5, 6]
[1, 2, 3, 7, 5, 6]

## Set

A Python set is the collection of the unordered items. Each element in the set must be unique, immutable, and the sets remove the duplicate elements. Sets are mutable which means we can modify it after its creation.

Unlike other collections in Python, there is no index attached to the elements of the set, i.e., we cannot directly access any element of the set by the index. However, we can print them all together, or we can get the list of elements by looping through the set.

In [ ]:
Days = {"Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"}    
print(Days)    
print(type(Days))

{'Thursday', 'Tuesday', 'Saturday', 'Friday', 'Monday', 'Sunday', 'Wednesday'}
<class 'set'>

It can contain any type of element such as integer, float, tuple etc. But mutable elements (list, dictionary, set) can't be a member of set. Consider the following example.

In [ ]:
# Creating a set which have immutable elements  
set1 = {1,2,3, "code school", 20.5, 14}  
print(type(set1))  
#Creating a set which have mutable element  
set2 = {1,2,3,["code school",4]}  
print(type(set2))

<class 'set'>

TypeError: ignored

## Dictionary

Python Dictionary is used to store the data in a key-value pair format. The dictionary is the data type in Python, which can simulate the real-life data arrangement where some specific value exists for some particular key. It is the mutable data-structure. The dictionary is defined into element Keys and values.

- Keys must be a single element
- Value can be any type such as list, tuple, integer, etc.

In other words, we can say that a dictionary is the collection of key-value pairs where the value can be any Python object. In contrast, the keys are the immutable Python object, i.e., Numbers, string, or tuple.

In [ ]:
Employee = {"Name": "John", "Age": 29, "salary":25000,"Company":"GOOGLE"}

Adding dictionary values

In [ ]:
# Creating an empty Dictionary   
Dict = {}   
print("Empty Dictionary: ")   
print(Dict)   
    
# Adding elements to dictionary one at a time   
Dict[0] = 'Peter'  
Dict[2] = 'Joseph'  
Dict[3] = 'Ricky'  
print("\nDictionary after adding 3 elements: ")   
print(Dict)   
    
# Adding set of values    
# with a single Key   
# The Emp_ages doesn't exist to dictionary  
Dict['Emp_ages'] = 20, 33, 24  
print("\nDictionary after adding 3 elements: ")   
print(Dict)   
    
# Updating existing Key's Value   
Dict[3] = 'JavaTpoint'  
print("\nUpdated key value: ")   
print(Dict)

:

In [ ]:
Employee = {"Name": "John", "Age": 29, "salary":25000,"Company":"GOOGLE"}    
print(type(Employee))    
print("printing Employee data .... ")    
print(Employee)    
print("Enter the details of the new employee....");    
Employee["Name"] = input("Name: ");    
Employee["Age"] = int(input("Age: "));    
Employee["salary"] = int(input("Salary: "));    
Employee["Company"] = input("Company:");    
print("printing the new data");    
print(Employee)

<class 'dict'>
printing Employee data ....
{'Name': 'John', 'Age': 29, 'salary': 25000, 'Company': 'GOOGLE'}
Enter the details of the new employee....
Name: duy
Age: 19
Salary: 500
Company:VNPT
printing the new data
{'Name': 'duy', 'Age': 19, 'salary': 500, 'Company': 'VNPT'}

get a key unavailable

In [ ]:
Employee = {"Name": "John", "Age": 29, "salary":25000,"Company":"GOOGLE"} 
Employee.get("location", "Vietnam")

'Vietnam'

Deleting elements using del keyword

In [ ]:
Employee = {"Name": "John", "Age": 29, "salary":25000,"Company":"GOOGLE"}    
print(type(Employee))    
print("printing Employee data .... ")    
print(Employee)    
print("Deleting some of the employee data")     
del Employee["Name"]    
del Employee["Company"]    
print("printing the modified information ")    
print(Employee)    
print("Deleting the dictionary: Employee");    
del Employee    
print("Lets try to print it again ");    
print(Employee)

<class 'dict'>
printing Employee data ....
{'Name': 'John', 'Age': 29, 'salary': 25000, 'Company': 'GOOGLE'}
Deleting some of the employee data
printing the modified information
{'Age': 29, 'salary': 25000}
Deleting the dictionary: Employee
Lets try to print it again

NameError: ignored

## Loop

![Loop](https://lh3.googleusercontent.com/Gsy3gvhT5OUjqobdPrCDaNL7B7G8I57KfjTD-cvwZNKjhm0dcHQ1VTZESRnyR3SrbOHhJUrX8UBZ_EO1uJxq3Ddlnxkn6W7F6Nxe7xjqgcqOLfuSN50PSm2vWVIiXxc9z-f_950-cI-NSp5Jd7j592c1yJ9qJySifchPwTPmdzbW2pcQfq5ZE-y3b30pmK1sZGd1U_hh9CjiiFowARUopdY7cz9xkhFg5TGusIxYChZHRmiFqf8eOgZpEDLH-aPNTygyQnArbE61YmUPjzj5-XA2yiXfqfbtS7lzPkMnQOuE5HImeaXnOzEKuJnGGBLi66k22PslajI-_RjyCh_YKsohjThxT-ocK6cw4v6mdDb3qq4etGdRePkhB3a1rlI-7NT62yWphsmbi4OHP2WSOJjpGfblOB-Ezi5irhofUIQJbUHSBDiMQ-fCzZGeJt_6xCXlg-AulJD51CuTHDd4F-sf9QCigiTfFKy0bYriXIhwq_l1MwhUGqWZ5UAamrf1H_HsVVK3UTUfwJN41s40gaH8vMI9fFr2cDlcivRFk43WaK9Ik9Nri1vYr7OeB8_tIMjp6Br2AP_2xbkCXRlyrR_5vsjgkAjuc3dgbiLYLJ37rneo2FTs1R5V48mi85oQjTN3x_Gc_mjExIGoq3tjmMI1hHLRaBWehEb-1QlGsMYo9qa1hQr9LcHcqg=w450-h300-no)

### While Loop

In [ ]:
a = 1
while a < 10:
    print(a)
    a += 2

1
3
5
7
9

In [ ]:
a = 0
while a < 20:
    if a % 5 == 0:
        print ("5 is one of %d factors" %a)
    a += 1

5 is one of 0 factors
5 is one of 5 factors
5 is one of 10 factors
5 is one of 15 factors

In [ ]:
names = ["Hoàng", "Hòa", "Dương", "Hùng", "Ngọc", "Lâm", "Đạt"]
names_length = len(names)
a = 0
while a < names_length:
    print(names[a])
    if names[a] == "Lâm":
        break
    a += 1

Hoàng
Hòa
Dương
Hùng
Ngọc
Lâm

In [ ]:
a = 1
while a < 10:
    print(a)
    a += 2
else:
    print("End while")

1
3
5
7
9
End while

### For in

In [ ]:
office_stuffs = ["Ballpoint Pen", "Pencil", "Glue Stick", "Erasor", "Pencil sharpener", "Stapler", "Scissors"]

for item in office_stuffs:
    print (item)

Ballpoint Pen
Pencil
Glue Stick
Erasor
Pencil sharpener
Stapler
Scissors

In [ ]:
other_stuffs = ["Paper Clip", "Binder Clip", "Pushpin", "Sticky labels", "Ring Binder"]
for item in other_stuffs:
    print (item)
else:
    print ("End for loop")

reference [Functions creating iterators for efficient looping](https://docs.python.org/3.8/library/itertools.html)

## Function

Reference [Function](https://www.tutorialspoint.com/python/python_functions.htm)

In [ ]:
def sayMyName(name):
    print ("Hi %s"%name)

In [ ]:
sayMyName("Ha")

Hi Ha

In [ ]:
sayMyName()

TypeError: ignored

Function non input

In [ ]:
a = 1
b = 3
def sum_a_b():
    return a + b
sum_a_b()

4

Function with input

In [ ]:
# ex 1

def eat(name, food="fish"):
    print ("%s eats %s regularly "%(name, food))

In [ ]:
eat("duy")

duy eats fish regularly

In [ ]:
eat("duy", "bean")

duy eats bean regularly

In [ ]:
# ex 2
def like(name, *foods):
    for food in foods:
        print ("%s likes %s"%(name, food))

In [ ]:
like("Duong")

In [ ]:
like("Ha", "cereal", "doughnut", "bagel")

Ha likes cereal
Ha likes doughnut
Ha likes bagel

lambda function

In [ ]:
mul = lambda x, y: x * y

In [ ]:
mul(3,4)

12

In [ ]:
asia = lambda *teams: teams

In [ ]:
asia("Vietnam", "Singapore")

('Vietnam', 'Singapore')

## SQL

- SQL stands for Structured Query Language.
- It is designed for managing data in a **relational database** management system (RDBMS).
- It is pronounced as S-Q-L or sometime See-Qwell.
- SQL is a database language, it is used for database creation, deletion, fetching rows, and modifying rows, etc.
- SQL is based on relational algebra and tuple relational calculus.

SQL is required:

- To create new databases, tables and views
- To insert records in a database
- To update records in a database
- To delete records from a database
- To retrieve data from a database

### SQL Commands

These are the some important SQL command:

- SELECT: it extracts data from a database.
- UPDATE: it updates data in database.
- DELETE: it deletes data from database.
- CREATE TABLE: it creates a new table.
- ALTER TABLE: it is used to modify the table.
- DROP TABLE: it deletes a table.
- CREATE DATABASE: it creates a new database.
- ALTER DATABASE: It is used to modify a database.
- INSERT INTO: it inserts new data into a database.
- CREATE INDEX: it is used to create an index (search key).
- DROP INDEX: it deletes an index.

### Connect to the database

![](https://i.imgur.com/kCaiMK5.png)

In [ ]:
# Download database
!wget https://ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com/devc/chinook.db

--2020-07-01 13:21:31--  https://ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com/devc/chinook.db
Resolving ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com (ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com)... 52.219.124.147
Connecting to ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com (ml101-khanhnguyen.s3-ap-southeast-1.amazonaws.com)|52.219.124.147|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 884736 (864K) [binary/octet-stream]
Saving to: ‘chinook.db’

chinook.db          100%[===================>] 864.00K  3.21MB/s    in 0.3s

2020-07-01 13:21:31 (3.21 MB/s) - ‘chinook.db’ saved [884736/884736]

In [ ]:
import sqlite3
conn = sqlite3.connect('chinook.db')

### SELECT statement

Given a table of data, the most basic query we could write would be one that selects for a couple columns (properties) of the table with all the rows (instances).

```SQL
SELECT "column_name" FROM "table_name";
```
If we want to retrieve absolutely all the columns of data from a table, we can then use the asterisk (*) shorthand in place of listing all the column names individually.

```SQL
SELECT * 
FROM table_name;
```

In [ ]:
import pandas as pd
data = pd.read_sql_query('SELECT * FROM tracks;', conn)
data.head()

   TrackId                                     Name  ...     Bytes  UnitPrice
0        1  For Those About To Rock (We Salute You)  ...  11170334       0.99
1        2                        Balls to the Wall  ...   5510424       0.99
2        3                          Fast As a Shark  ...   3990994       0.99
3        4                        Restless and Wild  ...   4331779       0.99
4        5                     Princess of the Dawn  ...   6290521       0.99

[5 rows x 9 columns]

#### Optional clauses in SELECT statement

There are some optional clauses in SELECT statement:

- [WHERE Clause] : It specifies which rows to retrieve.
- [ORDER BY Clause] : It specifies an order in which to return the rows.
- [GROUP BY Clause] : Groups rows that share a property so that the aggregate function can be applied to each group.
- [HAVING Clause] : It selects among the groups defined by the GROUP BY clause.

##### Queries with contraints

WHERE clause is used in SELECT, UPDATE, DELETE statement etc.

```sql
    SELECT column1, column 2, ... column n  
    FROM   table_name  
    WHERE  [conditions]  
```

Below are some useful operators that you can use for numerical data (ie. integer or floating point)

| Operator | Condition | SQL Example |
|:--------------:|:---------------:|:----------------------:|
| =, !=, < <=, >, >= | Standard numerical operators	| col_name != 4 |
| **BETWEEN** … **AND** …	| Number is within range of two values (inclusive) |	col_name **BETWEEN** 1.5 **AND** 10.5 |
| **NOT BETWEEN** … **AND** …	| Number is not within range of two values (inclusive) |	col_name **NOT BETWEEN** 1 **AND** 10 |
| **IN** (…)	| Number exists in a list	| col_name **IN** (2, 4, 6) |
| **NOT IN** (…) |	Number does not exist in a list |	col_name **NOT IN** (1, 3, 5) |

When writing WHERE clauses with columns containing text data, SQL supports a number of useful operators to do things like case-insensitive string comparison and wildcard pattern matching. Below is a few common text-data specific operators:

| Operator | Condition | SQL Example |
|:--------------:|:---------------:|:----------------------:|
| = |	Case sensitive exact string comparison (notice the single equals) |	col_name = "abc" |
| != or <>	| Case sensitive exact string inequality comparison	| col_name != "abcd" |
| **LIKE**	| Case insensitive exact string comparison	| col_name **LIKE** "ABC" |
| **NOT LIKE**	| Case insensitive exact string inequality comparison	| col_name **NOT LIKE** "ABCD" |
| %	| Used anywhere in a string to match a sequence of zero or more characters (only with **LIKE** or **NOT LIKE**)	| col_name **LIKE** "%AT%" (matches "AT", "ATTIC", "CAT" or even "BATS") |
| _	| Used anywhere in a string to match a single character (only with **LIKE** or **NOT LIKE**)	| col_name **LIKE** "AN_" (matches "AND", but not "AN") |
| **IN** (…) | String exists in a list	| col_name **IN** ("A", "B", "C") |
| **NOT IN** (…) | String does not exist in a list	| col_name **NOT IN** ("D", "E", "F") |

In [ ]:
pd.read_sql_query('SELECT * FROM tracks;',conn).sample(5)

      TrackId                    Name  ...    Bytes  UnitPrice
303       304              Firmamento  ...  7507866       0.99
256       257              Manguetown  ...  6475159       0.99
328       329       Garotas do Brasil  ...  6973625       0.99
2320     2321  Talk About The Passion  ...  6725435       0.99
2728     2729                 Emerald  ...  9543789       0.99

[5 rows x 9 columns]

###### AND condition

In [ ]:
query = '''
    SELECT * FROM tracks
    WHERE AlbumId = 3 AND UnitPrice > 0.98;
'''

pd.read_sql_query(query,conn).head()

   TrackId                  Name  AlbumId  ...  Milliseconds    Bytes UnitPrice
0        3       Fast As a Shark        3  ...        230619  3990994      0.99
1        4     Restless and Wild        3  ...        252051  4331779      0.99
2        5  Princess of the Dawn        3  ...        375418  6290521      0.99

[3 rows x 9 columns]

##### Filtering and Sorting query results

The SQL ORDER BY clause is used for sorting data in ascending and descending order based on one or more columns.

Some databases sort query results in ascending order by default.

```sql
    SELECT expressions  
    FROM tables  
    WHERE conditions  
    ORDER BY expression [ASC | DESC];
```

In [ ]:
query = '''
    SELECT * FROM invoices
    ORDER BY Total DESC;
'''

pd.read_sql_query(query,conn).head()

   InvoiceId  CustomerId  ... BillingPostalCode  Total
0        404           6  ...             14300  25.86
1        299          26  ...             76110  23.86
2         96          45  ...            H-1073  21.86
3        194          46  ...              None  21.86
4         89           7  ...              1010  18.86

[5 rows x 9 columns]

Another clause which is commonly used with the **ORDER BY** clause are the **LIMIT** and **OFFSET** clauses, which are a useful optimization to indicate to the database the subset of the results you care about.
The **LIMIT** will reduce the number of rows to return, and the optional **OFFSET** will specify where to begin counting the number rows from.

```
SELECT column, another_column, …
FROM mytable
WHERE condition(s)
ORDER BY column ASC/DESC
LIMIT num_limit OFFSET num_offset;
```

In [ ]:
query = '''
    SELECT * FROM invoices
    ORDER BY Total DESC
    LIMIT 5;
'''

pd.read_sql_query(query,conn)

   InvoiceId  CustomerId  ... BillingPostalCode  Total
0        404           6  ...             14300  25.86
1        299          26  ...             76110  23.86
2         96          45  ...            H-1073  21.86
3        194          46  ...              None  21.86
4         89           7  ...              1010  18.86

[5 rows x 9 columns]

##### SQL JOIN

As the name shows, JOIN means to combine something. In case of SQL, JOIN means "to combine two or more tables".

The SQL JOIN clause takes records from two or more tables in a database and combines it together.

ANSI standard SQL defines five types of JOIN :

1. inner join,
2. left outer join,
3. right outer join,
4. full outer join, and
5. cross join.

![](https://4.bp.blogspot.com/-_HsHikmChBI/VmQGJjLKgyI/AAAAAAAAEPw/JaLnV0bsbEo/s400/sql%2Bjoins%2Bguide%2Band%2Bsyntax.jpg)

###### OUTER JOINS

In the SQL outer JOIN all the content of the both tables are integrated together either they are matched or not.

In [ ]:
query = '''
    SELECT alb.Title, 
           art.Name
    FROM artists art, albums alb
    WHERE art.ArtistId = alb.ArtistId;
'''

pd.read_sql_query(query,conn)

                                                 Title                                               Name
0                For Those About To Rock We Salute You                                              AC/DC
1                                    Balls to the Wall                                             Accept
2                                    Restless and Wild                                             Accept
3                                    Let There Be Rock                                              AC/DC
4                                             Big Ones                                          Aerosmith
..                                                 ...                                                ...
342                             Respighi:Pines of Rome                                     Eugene Ormandy
343  Schubert: The Late String Quartets & String Qu...                             Emerson String Quartet
344                                Monteverdi: L'Orfeo  C. Monteverdi, Nigel Rogers - Chiaroscuro; Lon...
345                              Mozart: Chamber Music                                      Nash Ensemble
346  Koyaanisqatsi (Soundtrack from the Motion Pict...                              Philip Glass Ensemble

[347 rows x 2 columns]

##### Queries with aggregates

SQL also supports the use of aggregate expressions (or functions) that allow you to summarize information about a group of rows of data.

Common aggregate functions:

| Functions | Description |
|:-:|:-:|
|**COUNT**(*), **COUNT**(column) | A common function used to counts the number of rows in the group if no column name is specified. Otherwise, count the number of rows in the group with non-NULL values in the specified column.|
|**MIN**(column) | Finds the smallest numerical value in the specified column for all rows in the group.|
|**MAX**(column) | Finds the largest numerical value in the specified column for all rows in the group.|
|**AVG**(column) | Finds the average numerical value in the specified column for all rows in the group.|
|**SUM**(column) | Finds the sum of all numerical values in the specified column for the rows in the group.|

More docs: [SQLite](http://www.sqlite.org/lang_aggfunc.html), [MySQL](https://dev.mysql.com/doc/refman/5.6/en/group-by-functions.html), [Postgres](http://www.postgresql.org/docs/9.4/static/functions-aggregate.html)

In addition to aggregating across all the rows, you can instead apply the aggregate functions to individual groups of data within that group. This would then create as many results as there are unique groups defined as by the  **GROUP BY** clause.

```
SELECT AGG_FUNC(column_or_expression) AS aggregate_description, …
FROM mytable
WHERE constraint_expression
GROUP BY column;
```

Our queries are getting fairly complex, but we have nearly introduced all the important parts of a  **SELECT** query. One thing that you might have noticed is that if the **GROUP BY** clause is executed after the **WHERE** clause (which filters the rows which are to be grouped), then how exactly do we filter the grouped rows?

Luckily, SQL allows us to do this by adding an additional **HAVING** clause which is used specifically with the **GROUP BY** clause to allow us to filter grouped rows from the result set.

```
SELECT group_by_column, AGG_FUNC(column_expression) AS aggregate_result_alias, …
FROM mytable
WHERE condition
GROUP BY column
HAVING group_condition;
```

In [ ]:
query = '''
    SELECT count(CustomerId) FROM invoices;
'''

pd.read_sql_query(query,conn)

   count(CustomerId)
0                412

In [ ]:
query = '''
    SELECT AVG(Total) FROM invoices;
'''

pd.read_sql_query(query,conn)

   AVG(Total)
0    5.651942

##### INSERT, UPDATE, DELETE

In [ ]:
query = """
INSERT INTO artists (Name)
VALUES ('Duy Le');
"""
cur = conn.cursor()
cur.execute(query)
cur.close()

In [ ]:
query = """
INSERT INTO artists (Name)
VALUES ('Duy Le');
"""
pd.read_sql_query(query,conn) # Non return

TypeError: ignored

In [ ]:
query = '''
UPDATE artists  
SET Name = 'HP'  
WHERE ArtistId = 276
AND Name = 'Duy Le';
'''
cur = conn.cursor()
cur.execute(query)
cur.close()

In [ ]:
query = '''
    SELECT * FROM artists;
'''

pd.read_sql_query(query,conn)

     ArtistId                                               Name
0           1                                              AC/DC
1           2                                             Accept
2           3                                          Aerosmith
3           4                                  Alanis Morissette
4           5                                    Alice In Chains
..        ...                                                ...
271       272                             Emerson String Quartet
272       273  C. Monteverdi, Nigel Rogers - Chiaroscuro; Lon...
273       274                                      Nash Ensemble
274       275                              Philip Glass Ensemble
275       278                                             Duy Le

[276 rows x 2 columns]

In [ ]:
query = """
DELETE FROM artists  
WHERE Name = 'HP';
"""
cur = conn.cursor()
cur.execute(query)
cur.close()